<?php

return [
    /*
    |--------------------------------------------------------------------------
    | 캐싱 설정
    |--------------------------------------------------------------------------
    |
    */
    'cache' => false,

//    // 다음처럼 해도 좋다.
//    ! env('APP_DEBUG', false),
//    app()->environment('production'),


    /*
    |--------------------------------------------------------------------------
    | 프로젝트 기본 정보
    |--------------------------------------------------------------------------
    |
    */
    'name' => 'BlueCrank',
    'url' => env('APP_URL', 'http://localhost:8000'),
    'description' => '온라인으로 구매하고 집 근처 패밀리 매장에서 받자',

    /*
    |--------------------------------------------------------------------------
    | Tag 목록
    |--------------------------------------------------------------------------
    */
    'tags' => [
        'products' =>[
            'giant' => '자이언트',
            'fuji' => '후지',
            'focus' => '포커스',
            'canon' => '캐논데일',
            'goodprice' => '가성비갑',
            'female' => '여성용',
            'commute' => '출퇴근',
            'river' => '한강라이딩',
            'highend' => '하이엔드',
            'sale' => '특가할인',
        ],
        'olds' =>[
            'goodprice' => '가성비甲',
            'commute' => '출퇴근용',
            'forrider' => '라이더전용',
            'display' => '이뿌다잉',
            'highend' => '하이엔드',
        ],
        'articles' =>[
            'daily' => '일상',
            'tips' => '꿀팁',
            'humor' => '유머',
            'boast' => '자랑',
            'qna' => 'Q&A',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Category 목록
    |--------------------------------------------------------------------------
    */
    'categories' => [
        'road' => [
            'ko' => '로드',
            'en' => 'Road',
        ],
        'mtb' => [
            'ko' => 'MTB',
            'en' => 'MTB'
        ],
        'fixed' => [
            'ko' => '픽시',
            'en' => 'Fixed'
        ],
        'hybrid' => [
            'ko' => '하이브리드',
            'en' => 'Hybrid'
        ],
        'mini' => [
            'ko' => '미니벨로/기타',
            'en' => 'MiniVelo/Etc'
        ],
        'bacc' => [
            'ko' => '자전거 용품',
            'en' => 'Bike Accessory'
        ],
        'racc' => [
            'ko' => '라이더 용품',
            'en' => 'Rider Goods'
        ],
        'part' => [
            'ko' => '부품/부속',
            'en' => 'Parts/Attachment'
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Brand 목록
    |--------------------------------------------------------------------------
    */
    'brands' => [
        'BH','BMC','GT','LOOK','가젤','고스트','구와하라','다혼','데로사','도스노벤타','라이트스피드','라피에르','리더 바이크','리들리','리떼','린스키','마지','메리다','모델로','몰튼','무츠','뮤트자전거','바쏘','바이크플라이데이','바이큰','버디','벨로라인','보드만','브롬톤','비앙키','삼손','삼천리자전거','설리','세븐','스마트자전거','스위프트 카본','스캇','스톡','스트라이다','스페셜라이즈드','써벨로','씨포','아르곤18','아메리칸이글','알톤스포츠','언노운 바이크','에디 먹스','엔진 11','엘파마','예거','예티','오리바이크','오베아','위아위스','윌리어','인디펜던스','자이언트','제이미스','지오스','첼로','쵸치','쵸퍼바이크','치넬리','치폴리니','카레라','캐년','캐논데일','코나','코라텍','코렉스','콘도르','콘스탄틴','콜나고','콜로시','쿠오타','큐브','타임','턴','토마지니','트렉 바이크','트리곤','파쏘니','팔리','펠리쫄리','펠트','포커스','피나렐로','하이바이크','후지','휠러','아벤톤','기타',
    ],

    /*
    |--------------------------------------------------------------------------
    | Size 목록
    |--------------------------------------------------------------------------
    */
    'sizes' => [
        'XS', 'S', 'M', 'L', 'XL',
        '460', '480', '500', '520', '540',
    ],

    /*
    |--------------------------------------------------------------------------
    | 업로드할 수 있는 파일 확장자
    |--------------------------------------------------------------------------
    */
    'mimes' => [
        'png',
        'jpg',
    ],

    /*
    |--------------------------------------------------------------------------
    | 정렬 필드
    |--------------------------------------------------------------------------
    |
    */
    'sorting' => [
        'view_count' => '조회수',
        'price' => '가격순',
        'created_at' => '작성일',
    ],

    /*
    |--------------------------------------------------------------------------
    | 지원하는 언어 목록
    |--------------------------------------------------------------------------
    */
    'locales' => [
        'ko' => '한국어',
        'en' => 'English',
    ],

    /*
    |--------------------------------------------------------------------------
    | 주문서 상태 리스트
    |--------------------------------------------------------------------------
    */
    'order_status' => [
        'deposit' => '입금전',
        'checked' => '입금완료',
        'prepare' => '배송준비',
        'shipping' => '배송중',
        'arrive' => '배송완료',
        'confirm' => '구매결정',
        'cancel' => '취소',
        'exchange' => '교환',
        'return' => '반품',
    ],

];